TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_deadband/am263px-lp/r5fss0-0_nortos/example.syscfg
mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

input_xbar1.$name      = "CONFIG_INPUT_XBAR0";
input_xbar1.xbarOutput = "GPIO43";

input_xbar2.$name      = "CONFIG_INPUT_XBAR1";
input_xbar2.instance   = "INPUT_XBAR_1";
input_xbar2.xbarOutput = "GPIO45";

input_xbar3.$name      = "CONFIG_INPUT_XBAR2";
input_xbar3.instance   = "INPUT_XBAR_2";
input_xbar3.xbarOutput = "GPIO46";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution           = "ball.B2";
epwm1.EPWM.B.$suggestSolution           = "ball.B1";
epwm2.EPWM.A.$suggestSolution           = "ball.D3";
epwm2.EPWM.B.$suggestSolution           = "ball.D2";
epwm3.EPWM.A.$suggestSolution           = "ball.C2";
epwm3.EPWM.B.$suggestSolution           = "ball.C1";
epwm4.EPWM.A.$suggestSolution           = "ball.E2";
epwm4.EPWM.B.$suggestSolution           = "ball.E3";
epwm5.EPWM.A.$suggestSolution           = "ball.K4";
epwm5.EPWM.B.$suggestSolution           = "ball.K3";
epwm6.EPWM.A.$suggestSolution           = "ball.P16";
epwm6.EPWM.B.$suggestSolution           = "ball.M18";
epwm7.EPWM.A.$suggestSolution           = "ball.R17";
epwm7.EPWM.B.$suggestSolution           = "ball.N18";
debug_log.uartLog.UART.$suggestSolution = "UART0";
